Revit 2026 API

# DuctFittingAndAccessoryPressureDropData Properties

---

The DuctFittingAndAccessoryPressureDropData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CalculationType | The calculation type, a bitmask of FittingAndAccessoryCalculationType. |
|  | IsCurrentEntityValid | True if the current settings stored in the entity is valid. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

DuctFittingAndAccessoryPressureDropData Class

Autodesk.Revit.DB.Mechanical Namespace